apache/nuttx/arch/arm/src/xmc4/xmc4_pwm.c
/*****************************************************************************
 * arch/arm/src/xmc4/xmc4_pwm.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 *****************************************************************************/

/*****************************************************************************
 * Included Files
 *****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdint.h>
#include <stdio.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "xmc4_pwm.h"
#include "xmc4_gpio.h"
#include "xmc4_clockconfig.h"
#include "hardware/xmc4_ccu4.h"
#include "hardware/xmc4_scu.h"
#include "hardware/xmc4_pinmux.h"

/*****************************************************************************
 * Pre-processor Definitions
 *****************************************************************************/

/*****************************************************************************
 * Private Types
 *****************************************************************************/

/* This structure represents the state of one PWM timer */

struct xmc4_pwm_s
{
  const struct pwm_ops_s *ops; /* PWM operations */
  uint8_t module;              /* CCU4x Module number {0,...,4} */
  uint8_t slice;               /* CC4y Slice number {0,...,4} */
  uint8_t prescaler;           /* Clock division for f_tclk */
  uint32_t frequency;          /* Current frequency setting */
  ub16_t duty;                 /* Current duty setting */
  uint32_t base;               /* The base address of the CCU4x module */
  uint32_t f_tclk;             /* The frequency of the module clock */
  uint32_t outgpio;            /* The output pin config (set in board.h) */
};

/*****************************************************************************
 * Private Function Prototypes
 *****************************************************************************/

/* PWM Register access */

static inline void xmc4_pwm_putreg32(struct xmc4_pwm_s *priv,
                                     uint32_t offset,
                                     uint32_t value);
static inline uint32_t xmc4_pwm_getreg32(struct xmc4_pwm_s *priv,
                                         uint32_t offset);
static void xmc4_pwm_modifyreg32(struct xmc4_pwm_s *priv,
                                 uint32_t offset,
                                 uint32_t clearbits,
                                 uint32_t setbits);

/* PWM driver methods */

static int pwm_setup(struct pwm_lowerhalf_s *dev);
static int pwm_shutdown(struct pwm_lowerhalf_s *dev);
static int pwm_start(struct pwm_lowerhalf_s *dev,
                     const struct pwm_info_s *info);
static int pwm_stop(struct pwm_lowerhalf_s *dev);
static int pwm_ioctl(struct pwm_lowerhalf_s *dev, int cmd, unsigned long arg);

/* PWM helper method */

static int pwm_set_period_match(struct xmc4_pwm_s *priv, uint16_t period_val);
static int pwm_set_compare_match(struct xmc4_pwm_s *priv,
                                 uint16_t compare_val);
static int pwm_set_passive_level(struct xmc4_pwm_s *priv, uint8_t level);
static int pwm_shadow_transfert(struct xmc4_pwm_s *priv);
static int pwm_enable_slice_clock(struct xmc4_pwm_s *priv);
static int pwm_disable_slice_clock(struct xmc4_pwm_s *priv);
static int pwm_start_slice_timer(struct xmc4_pwm_s *priv);
static int pwm_stop_slice_timer(struct xmc4_pwm_s *priv);
static bool pwm_is_slice_timer_running(struct xmc4_pwm_s *priv);
static int pwm_set_slice_prescaler(struct xmc4_pwm_s *priv,
                                   uint8_t prescaler);
static int pwm_start_module_prescaler(struct xmc4_pwm_s *priv);
static int pwm_stop_module_prescaler(struct xmc4_pwm_s *priv);
static int pwm_enable_module(struct xmc4_pwm_s *priv);
static int pwm_disable_module(struct xmc4_pwm_s *priv);
static bool pwm_is_module_used(struct xmc4_pwm_s *priv);
static int pwm_compute_config(struct xmc4_pwm_s *priv,
                          const struct pwm_info_s *info,
                          uint8_t *prescaler,
                          uint16_t *period,
                          uint16_t *compare);
static int pwm_timer(struct xmc4_pwm_s *priv, const struct pwm_info_s *info);

/*****************************************************************************
 * Private Data
 *****************************************************************************/

static const struct pwm_ops_s g_pwmops =
    {
        .setup = pwm_setup,
        .shutdown = pwm_shutdown,
        .start = pwm_start,
        .stop = pwm_stop,
        .ioctl = pwm_ioctl,
};

#ifdef CONFIG_XMC4_CCU40
#ifdef CONFIG_XMC4_CCU40_CC40
static struct xmc4_pwm_s g_pwm00 =
    {
        .ops = &g_pwmops,
        .module = 0,
        .slice = 0,
        .base = XMC4_CCU40_BASE,
        .outgpio = GPIO_CCU40_OUT0,
};
#endif

#ifdef CONFIG_XMC4_CCU40_CC41
static struct xmc4_pwm_s g_pwm01 =
    {
        .ops = &g_pwmops,
        .module = 0,
        .slice = 1,
        .base = XMC4_CCU40_BASE,
        .outgpio = GPIO_CCU40_OUT1,
};
#endif

#ifdef CONFIG_XMC4_CCU40_CC42
static struct xmc4_pwm_s g_pwm02 =
    {
        .ops = &g_pwmops,
        .module = 0,
        .slice = 2,
        .base = XMC4_CCU40_BASE,
        .outgpio = GPIO_CCU40_OUT2,
};
#endif

