apache/nuttx/arch/arm/src/xmc4/xmc4_pwm.c
#ifdef CONFIG_XMC4_CCU40_CC43
static struct xmc4_pwm_s g_pwm03 =
    {
        .ops = &g_pwmops,
        .module = 0,
        .slice = 3,
        .base = XMC4_CCU40_BASE,
        .outgpio = GPIO_CCU40_OUT3,
};
#endif
#endif /* CONFIG_XMC4_CCU40 */

#ifdef CONFIG_XMC4_CCU41
#ifdef CONFIG_XMC4_CCU41_CC40
static struct xmc4_pwm_s g_pwm10 =
    {
        .ops = &g_pwmops,
        .module = 1,
        .slice = 0,
        .base = XMC4_CCU41_BASE,
        .outgpio = GPIO_CCU41_OUT0,
};
#endif

#ifdef CONFIG_XMC4_CCU41_CC41
static struct xmc4_pwm_s g_pwm11 =
    {
        .ops = &g_pwmops,
        .module = 1,
        .slice = 1,
        .base = XMC4_CCU41_BASE,
        .outgpio = GPIO_CCU41_OUT1,
};
#endif

#ifdef CONFIG_XMC4_CCU41_CC42
static struct xmc4_pwm_s g_pwm12 =
    {
        .ops = &g_pwmops,
        .module = 1,
        .slice = 2,
        .base = XMC4_CCU41_BASE,
        .outgpio = GPIO_CCU41_OUT2,
};
#endif

#ifdef CONFIG_XMC4_CCU41_CC43
static struct xmc4_pwm_s g_pwm13 =
    {
        .ops = &g_pwmops,
        .module = 1,
        .slice = 3,
        .base = XMC4_CCU41_BASE,
        .outgpio = GPIO_CCU41_OUT3,
};
#endif
#endif /* CONFIG_XMC4_CCU41 */

#ifdef CONFIG_XMC4_CCU42
#ifdef CONFIG_XMC4_CCU42_CC40
static struct xmc4_pwm_s g_pwm20 =
    {
        .ops = &g_pwmops,
        .module = 2,
        .slice = 0,
        .base = XMC4_CCU42_BASE,
        .outgpio = GPIO_CCU42_OUT0,
};
#endif

#ifdef CONFIG_XMC4_CCU42_CC41
static struct xmc4_pwm_s g_pwm21 =
    {
        .ops = &g_pwmops,
        .module = 2,
        .slice = 1,
        .base = XMC4_CCU42_BASE,
        .outgpio = GPIO_CCU42_OUT1,
};
#endif

#ifdef CONFIG_XMC4_CCU42_CC42
static struct xmc4_pwm_s g_pwm22 =
    {
        .ops = &g_pwmops,
        .module = 2,
        .slice = 2,
        .base = XMC4_CCU42_BASE,
        .outgpio = GPIO_CCU42_OUT2,
};
#endif

#ifdef CONFIG_XMC4_CCU42_CC43
static struct xmc4_pwm_s g_pwm23 =
    {
        .ops = &g_pwmops,
        .module = 2,
        .slice = 3,
        .base = XMC4_CCU42_BASE,
        .outgpio = GPIO_CCU42_OUT3,
};
#endif
#endif /* CONFIG_XMC4_CCU42 */

#ifdef CONFIG_XMC4_CCU43
#ifdef CONFIG_XMC4_CCU43_CC40
static struct xmc4_pwm_s g_pwm30 =
    {
        .ops = &g_pwmops,
        .module = 3,
        .slice = 0,
        .base = XMC4_CCU43_BASE,
        .outgpio = GPIO_CCU43_OUT0,
};
#endif

#ifdef CONFIG_XMC4_CCU43_CC41
static struct xmc4_pwm_s g_pwm31 =
    {
        .ops = &g_pwmops,
        .module = 3,
        .slice = 1,
        .base = XMC4_CCU43_BASE,
        .outgpio = GPIO_CCU43_OUT1,
};
#endif

#ifdef CONFIG_XMC4_CCU43_CC42
static struct xmc4_pwm_s g_pwm32 =
    {
        .ops = &g_pwmops,
        .module = 3,
        .slice = 2,
        .base = XMC4_CCU43_BASE,
        .outgpio = GPIO_CCU43_OUT2,
};
#endif

#ifdef CONFIG_XMC4_CCU43_CC43
static struct xmc4_pwm_s g_pwm33 =
    {
        .ops = &g_pwmops,
        .module = 3,
        .slice = 3,
        .base = XMC4_CCU43_BASE,
        .outgpio = GPIO_CCU43_OUT3,
};
#endif
#endif /* CONFIG_XMC4_CCU43 */

/*****************************************************************************
 * Private Functions
 *****************************************************************************/

/*****************************************************************************
 * Name: xmc4_pwm_putreg32
 *
 * Description:
 *   Put a 32-bit register value by offset
 *
 *****************************************************************************/

static inline void xmc4_pwm_putreg32(struct xmc4_pwm_s *priv,
                                     uint32_t offset,
                                     uint32_t value)
{
  putreg32(value, priv->base + offset);
}

/*****************************************************************************
 * Name: xmc4_pwm_getreg32
 *
 * Description:
 *   Get a 32-bit register value by offset
 *
 *****************************************************************************/

static inline uint32_t xmc4_pwm_getreg32(struct xmc4_pwm_s *priv,
                                         uint32_t offset)
{
  return getreg32(priv->base + offset);
}

/*****************************************************************************
 * Name: xmc4_pwm_modifyreg32
 *
 * Description:
 *   Modify a 32-bit register value by offset
 *
 *****************************************************************************/

static void xmc4_pwm_modifyreg32(struct xmc4_pwm_s *priv,
                                 uint32_t offset,
                                 uint32_t clearbits,
                                 uint32_t setbits)
{
  modifyreg32(priv->base + offset, clearbits, setbits);
}

/*****************************************************************************
 * Name: pwm_set_period_match
 *
 * Description:
 *   Set the period match register (CC4yPRS.PRS).
 *   Must call pwm_shadow_transfert() after.
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_set_period_match(struct xmc4_pwm_s *priv, uint16_t period_val)
{
  DEBUGASSERT(priv != NULL);

  uint32_t cc4yprs_offset =
      (uint32_t)(XMC4_CCU4_CC40PRS_OFFSET + 0x0100 * priv->slice);

  xmc4_pwm_putreg32(priv, cc4yprs_offset, period_val);

  pwminfo("PWM CCU4%d,CC4%d period is : %d\n",
          priv->module, priv->slice, period_val);

  return OK;
}

/*****************************************************************************
 * Name: pwm_set_compare_match
 *
 * Description:
 *   Set the compare match register (CC4yCRS.CRS).
 *   Must call pwm_shadow_transfert() after.
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_set_compare_match(struct xmc4_pwm_s *priv,
                                  uint16_t compare_val)
{
  DEBUGASSERT(priv != NULL);

  uint32_t cc4ycrs_offset =
      (uint32_t)(XMC4_CCU4_CC40CRS_OFFSET + 0x0100 * priv->slice);

  xmc4_pwm_putreg32(priv, cc4ycrs_offset, compare_val);

  pwminfo("PWM CCU4%d,CC4%d compare is : %d\n",
          priv->module, priv->slice, compare_val);

  return OK;
}

/*****************************************************************************
 * Name: pwm_set_passive_level
 *
 * Description:
 *   Set the passive level of the PWM slice.
 *   Must call pwm_shadow_transfert() after.
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_set_passive_level(struct xmc4_pwm_s *priv, uint8_t level)
{
  DEBUGASSERT(priv != NULL);

  uint32_t passive_level = (uint32_t)(level == 1);

  uint32_t cc4ypsl_offset =
      (uint32_t)(XMC4_CCU4_CC40PSL_OFFSET + 0x0100 * priv->slice);

