apache/nuttx/arch/arm/src/xmc4/xmc4_pwm.c
  xmc4_pwm_putreg32(priv, cc4ypsl_offset, passive_level);

  pwminfo("PWM CCU4%d,CC4%d passive level is : %d\n",
          priv->module, priv->slice, passive_level);

  return OK;
}

/*****************************************************************************
 * Name: pwm_shadow_transfert
 *
 * Description:
 *   Enable the transfer of the CRS, PRS and PSL registers for the next
 *   period. Must be called if one of these register is changed.
 *   Must call pwm_shadow_transfert() after.
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_shadow_transfert(struct xmc4_pwm_s *priv)
{
  DEBUGASSERT(priv != NULL);

  uint32_t shadow_transfert_mask = 1 << (priv->slice * 4);

  xmc4_pwm_modifyreg32(priv, XMC4_CCU4_GCSS_OFFSET, 0,
                       shadow_transfert_mask);

  return OK;
}

/*****************************************************************************
 * Name: pwm_enable_slice_clock
 *
 * Description:
 *   Enable the prescaller clock for the given slice.
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_enable_slice_clock(struct xmc4_pwm_s *priv)
{
  DEBUGASSERT(priv != NULL);

  uint32_t mask = (1 << priv->slice);

  xmc4_pwm_modifyreg32(priv, XMC4_CCU4_GIDLC_OFFSET, 0, mask);

  pwminfo("PWM CCU4%d,CC4%d clock is enabled\n", priv->module, priv->slice);

  return OK;
}

/*****************************************************************************
 * Name: pwm_disable_slice_clock
 *
 * Description:
 *   Disable the prescaller clock for the given slice.
 *
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_disable_slice_clock(struct xmc4_pwm_s *priv)
{
  DEBUGASSERT(priv != NULL);

  uint32_t mask = (1 << priv->slice);

  xmc4_pwm_modifyreg32(priv, XMC4_CCU4_GIDLS_OFFSET, 0, mask);

  pwminfo("PWM CCU4%d,CC4%d clock is disabled\n",
          priv->module, priv->slice);

  return OK;
}

/*****************************************************************************
 * Name: pwm_start_slice_timer
 *
 * Description:
 *   Start the timer counter for the given slice.
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_start_slice_timer(struct xmc4_pwm_s *priv)
{
  DEBUGASSERT(priv != NULL);

  uint32_t cc4ytcset_offset =
      (uint32_t)(XMC4_CCU4_CC40TCSET_OFFSET + 0x0100 * priv->slice);

  xmc4_pwm_putreg32(priv, cc4ytcset_offset,
                    (uint32_t)CCU4_CC4_TCSET_TRBS_MASK);

  pwminfo("PWM CCU4%d,CC4%d timer is running\n", priv->module, priv->slice);

  return OK;
}

/*****************************************************************************
 * Name: pwm_stop_slice_timer
 *
 * Description:
 *   Stop the timer counter for the given slice. Reset the counter.
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_stop_slice_timer(struct xmc4_pwm_s *priv)
{
  DEBUGASSERT(priv != NULL);

  uint32_t cc4ytcclr_offset =
      (uint32_t)(XMC4_CCU4_CC40TCCLR_OFFSET + 0x0100 * priv->slice);

  xmc4_pwm_putreg32(priv, cc4ytcclr_offset,
                    (uint32_t)(CCU4_CC4_TCCLR_TRBC_MASK |
                    CCU4_CC4_TCCLR_TCC_MASK));

  pwminfo("PWM CCU4%d,CC4%d timer is stopped\n", priv->module, priv->slice);

  return OK;
}

/*****************************************************************************
 * Name: pwm_is_slice_timer_running
 *
 * Description:
 *   Get the state (running timer or not) of the slice.
 *
 *
 * Returned Value:
 *   0 if slice timer is stopped else true if timmer running.
 *
 *****************************************************************************/

static bool pwm_is_slice_timer_running(struct xmc4_pwm_s *priv)
{
  DEBUGASSERT(priv != NULL);

  uint32_t cc4ytst_offset =
      (uint32_t)(XMC4_CCU4_CC40TST_OFFSET + 0x0100 * priv->slice);

  bool status = (bool)((xmc4_pwm_getreg32(priv, cc4ytst_offset) &
                        (uint32_t)CCU4_CC4_TCST_TRB_MASK) ==
                        (uint32_t)CCU4_CC4_TCST_TRB_MASK);

  pwminfo("PWM CCU4%d,CC4%d timer status is :%d\n",
            priv->module, priv->slice, status);

  return status;
}

/*****************************************************************************
 * Name: pwm_set_slice_prescaler
 *
 * Description:
 *   Set the value of the prescaler [0-14] in CC4yPSC.PSIV.
 *   Slice must be restarted for effective change.
 *   Update the value of prescaler in related xmc4_pwm_s.
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_set_slice_prescaler(struct xmc4_pwm_s *priv, uint8_t prescaler)
{
  DEBUGASSERT(priv != NULL);
  DEBUGASSERT(prescaler < 15);

  if (prescaler >= 15)
    {
      return -EINVAL;
    }

  uint32_t cc4ypsc_offset =
      (uint32_t)(XMC4_CCU4_CC40PSC_OFFSET + 0x0100 * priv->slice);

  xmc4_pwm_putreg32(priv, cc4ypsc_offset, (uint32_t)prescaler);

  priv->prescaler = prescaler;

  pwminfo("PWM CCU4%d,CC4%d prescaler is set to : %d\n",
            priv->module, priv->slice, prescaler);

  return OK;
}

/*****************************************************************************
 * Name: pwm_start_module_prescaler
 *
 * Description:
 *   Start the CCU4x module prescaler (CCU4xGIDLC.SPRB)
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_start_module_prescaler(struct xmc4_pwm_s *priv)
{
  DEBUGASSERT(priv != NULL);

  xmc4_pwm_modifyreg32(priv, XMC4_CCU4_GIDLC_OFFSET, 0, CCU4_GIDLC_SPRB_MASK);

  pwminfo("PWM CCU4%d prescaler is started\n", priv->module);

  return OK;
}

/*****************************************************************************
 * Name: pwm_stop_module_prescaler
 *
 * Description:
 *   Stop the CCU4x module prescaler (CCU4xGIDLS.CPRB)
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

