apache/nuttx/arch/arm/src/xmc4/xmc4_pwm.c
static int pwm_stop_module_prescaler(struct xmc4_pwm_s *priv)
{
  DEBUGASSERT(priv != NULL);

  xmc4_pwm_modifyreg32(priv, XMC4_CCU4_GIDLS_OFFSET, 0, CCU4_GIDLS_CPRB_MASK);

  pwminfo("PWM CCU4%d prescaler is stopped\n", priv->module);

  return OK;
}

/*****************************************************************************
 * Name: pwm_enable_module
 *
 * Description:
 *   Enable the CCU4x module (ungate and de-assert reset).
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_enable_module(struct xmc4_pwm_s *priv)
{
  DEBUGASSERT(priv != NULL);

  if (priv->module == 3)
    {
#ifdef XMC4_SCU_GATING
      /* Check if peripheral is gated */

      if ((getreg32(XMC4_SCU_CGATSTAT1) && SCU_CGAT1_CCU43))
        {
          putreg32(SCU_CGAT1_CCU43, XMC4_SCU_CGATCLR1); /* Ungate it */
        }

#endif
      /* Check if peripheral reset is asserted */

      if ((getreg32(XMC4_SCU_PRSTAT1) && SCU_PR1_CCU43RS))
        {
          putreg32(SCU_PR1_CCU43RS, XMC4_SCU_PRCLR1); /* De-assert reset */
        }
    }
  else
    {
      uint32_t scu_ccu4x_mask = (uint32_t)(1 << (priv->module + 2));

#ifdef XMC4_SCU_GATING
      if ((getreg32(XMC4_SCU_CGATSTAT0) && scu_ccu4x_mask))
        {
          putreg32(scu_ccu4x_mask, XMC4_SCU_CGATCLR0);
        }

#endif
      if ((getreg32(XMC4_SCU_PRSTAT0) && scu_ccu4x_mask))
        {
          putreg32(scu_ccu4x_mask, XMC4_SCU_PRCLR0);
        }
    }

  pwminfo("PWM CCU4%d module is enabled\n", priv->module);

  return OK;
}

/*****************************************************************************
 * Name: pwm_enable_module
 *
 * Description:
 *   Disable the CCU4x module (gate and assert reset).
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure.
 *
 *****************************************************************************/

static int pwm_disable_module(struct xmc4_pwm_s *priv)
{
  DEBUGASSERT(priv != NULL);

  if (priv->module == 3)
    {
      /* Assert reset */

      putreg32(SCU_PR1_CCU43RS, XMC4_SCU_PRCLR1);

#ifdef XMC4_SCU_GATING
      /* Gate clock */

      putreg32(SCU_CGAT1_CCU43, XMC4_SCU_CGATSET1);
#endif
    }
  else
    {
      uint32_t scu_ccu4x_mask = (uint32_t)(1 << (priv->module + 2));

      putreg32(scu_ccu4x_mask, XMC4_SCU_PRSET0);

#ifdef XMC4_SCU_GATING
      putreg32(scu_ccu4x_mask, XMC4_SCU_CGATSET0);
#endif
    }

  pwminfo("PWM CCU4%d module is disabled\n", priv->module);

  return OK;
}

/*****************************************************************************
 * Name: pwm_is_module_used
 *
 * Description:
 *   Get the state (running timer or not) of the slice.
 *
 * Returned Value:
 *   0 if module is idle, else true if one slice or more is running.
 *
 *****************************************************************************/

static bool pwm_is_module_used(struct xmc4_pwm_s *priv)
{
  DEBUGASSERT(priv != NULL);

  uint32_t idle_status = xmc4_pwm_getreg32(priv, XMC4_CCU4_GSTAT_OFFSET);
  uint32_t mask = (CCU4_GSTAT_S0I_MASK |
                   CCU4_GSTAT_S1I_MASK |
                   CCU4_GSTAT_S2I_MASK |
                   CCU4_GSTAT_S3I_MASK);

  idle_status &= mask;

  bool is_used = !(idle_status == mask);

  pwminfo("PWM CCU4%d is used ? : %d\n", priv->module, is_used);

  return is_used;
}

/*****************************************************************************
 * Name: pwm_compute_config
 *
 * Description:
 *   Compute the prescaler value, compare and period match for the given
 *   info config.
 *
 * Input Parameters:
 *   priv - A reference to the lower half PWM driver state structure
 *   info - A reference to the characteristics of the pulsed output
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_compute_config(struct xmc4_pwm_s *priv,
                          const struct pwm_info_s *info,
                          uint8_t *prescaler,
                          uint16_t *period,
                          uint16_t *compare)
{
  DEBUGASSERT(priv != NULL);
  DEBUGASSERT(info != NULL);
  DEBUGASSERT(prescaler != NULL);
  DEBUGASSERT(period != NULL);
  DEBUGASSERT(compare != NULL);

  uint32_t f_ccu = xmc4_get_ccuclock();

  pwminfo("PWM f_ccu is %d\n", f_ccu);

  uint32_t f_tclk = 0;
  uint8_t new_prescaler = 0;
  uint32_t prs = 0;
  uint32_t crs = 0;

  uint32_t f_pwm = info->frequency;
  float duty_cycle = (1.0 - b16tof(info->channels[0].duty));

  do
    {
      f_tclk = f_ccu >> new_prescaler;
      new_prescaler += 1;
      prs = f_tclk / f_pwm - 1;
      crs = (uint32_t)(duty_cycle * (prs + 1));
    }
  while ((prs > UINT16_MAX) || (crs > UINT16_MAX));

  if (new_prescaler > 15)
    {
      return -EINVAL;
    }

  *period = (uint16_t)prs;
  *compare = (uint16_t)crs;
  *prescaler = (uint8_t)(new_prescaler - 1);
  priv->f_tclk = f_tclk;

  return OK;
}

/*****************************************************************************
 * Name: pwm_timer
 *
 * Description:
 *   (Re-)initialize the timer resources and start the pulsed output
 *
 * Input Parameters:
 *   priv - A reference to the lower half PWM driver state structure
 *   info - A reference to the characteristics of the pulsed output
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_timer(struct xmc4_pwm_s *priv, const struct pwm_info_s *info)
{
  DEBUGASSERT(priv != NULL);
  DEBUGASSERT(info != NULL);

  uint8_t new_prescaler;
  uint16_t crs;
  uint16_t prs;

  int ret = pwm_compute_config(priv, info, &new_prescaler, &prs, &crs);
  if (ret < 0)
    {
      return -EINVAL;
    }

  if (info->frequency != priv->frequency)
    {
      /* Is slice timer running ? */

      if (pwm_is_slice_timer_running(priv))
        {
          /* Slice is running */

          if (new_prescaler == priv->prescaler)
            {
              /* Prescaller doesn't change, update shadow transfer */

