apache/nuttx/arch/arm/src/xmc4/xmc4_pwm.c
              pwm_set_period_match(priv, prs);
              pwm_set_compare_match(priv, crs);
              pwm_set_passive_level(priv, info->channels[0].cpol);
              pwm_shadow_transfert(priv);
            }
          else
            {
              /* Stop slice to update prescaler */

              pwm_stop_slice_timer(priv);
              pwm_disable_slice_clock(priv);

              pwm_set_slice_prescaler(priv, new_prescaler);

              pwm_set_compare_match(priv, crs);
              pwm_set_period_match(priv, prs);
              pwm_set_passive_level(priv, info->channels[0].cpol);
              pwm_shadow_transfert(priv);

              pwm_enable_slice_clock(priv);
              pwm_start_slice_timer(priv);
            }
        }
      else
        {
          /* Slice isn't running, start it */

          pwm_set_slice_prescaler(priv, new_prescaler);

          pwm_set_compare_match(priv, crs);
          pwm_set_period_match(priv, prs);
          pwm_set_passive_level(priv, info->channels[0].cpol);
          pwm_shadow_transfert(priv);

          pwm_enable_slice_clock(priv);
          pwm_start_slice_timer(priv);
        }

      priv->frequency = info->frequency;
      priv->duty = info->channels[0].duty;
    }
  else
    {
      /* Frequency doesn't change, update shadow transfer */

      pwm_set_compare_match(priv, crs);
      pwm_set_passive_level(priv, info->channels[0].cpol);
      pwm_shadow_transfert(priv);

      priv->duty = info->channels[0].duty;
    }

  return OK;
}

/*****************************************************************************
 * Name: pwm_setup
 *
 * Description:
 *   This method is called when the driver is opened.  The lower half driver
 *   should configure and initialize the device so that it is ready for use.
 *   It should not, however, output pulses until the start method is called.
 *
 * Input Parameters:
 *   dev - A reference to the lower half PWM driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_setup(struct pwm_lowerhalf_s *dev)
{
  struct xmc4_pwm_s *priv = (struct xmc4_pwm_s *)dev;

  DEBUGASSERT(priv != NULL);

  int ret = OK;

  pwminfo("PWM CCU4%d,CC4%d is being used\n", priv->module, priv->slice);

  /* Set the selected GPIO as the CCU4 output alternate function */

  ret = xmc4_gpio_config((gpioconfig_t)priv->outgpio);

  /* Check if CCU4 is clocked in SCU */

  if ((getreg32(XMC4_SCU_CLKSTAT) & (uint32_t)SCU_CLK_CCUC) == 0)
    {
      /* Enable CCU4 clock */

      putreg32(SCU_CLK_CCUC, XMC4_SCU_CLKSET);
    }

  /* Enable CCU clock during sleep */

  if ((getreg32(XMC4_SCU_SLEEPCR) & (uint32_t)(SCU_SLEEPCR_CCUCR)) == 0)
    {
      putreg32(SCU_SLEEPCR_CCUCR | SCU_SLEEPCR_SYSSEL, XMC4_SCU_SLEEPCR);
    }

  /* Activate CCU4x module */

  ret |= pwm_enable_module(priv);

  /* Start the prescaller of the module */

  ret |= pwm_start_module_prescaler(priv);

  return ret;
}

static int pwm_start(struct pwm_lowerhalf_s *dev,
                     const struct pwm_info_s *info)
{
  struct xmc4_pwm_s *priv = (struct xmc4_pwm_s *)dev;

  DEBUGASSERT(priv != NULL);

  pwminfo("PWM CCU4%d,CC4%d is started\n", priv->module, priv->slice);

  return pwm_timer(priv, info);
}

/*****************************************************************************
 * Name: pwm_stop
 *
 * Description:
 *   Stop the timer resources.
 *
 * Input Parameters:
 *   priv - A reference to the lower half PWM driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_stop(struct pwm_lowerhalf_s *dev)
{
  struct xmc4_pwm_s *priv = (struct xmc4_pwm_s *)dev;

  DEBUGASSERT(priv != NULL);

  pwm_stop_slice_timer(priv);
  pwm_disable_slice_clock(priv);

  priv->frequency = 0;
  priv->duty = 0;

  pwminfo("PWM CCU4%d,CC4%d is stopped\n", priv->module, priv->slice);

  return OK;
}

/*****************************************************************************
 * Name: pwm_stop
 *
 * Description:
 *   Stop the timer resources and disable hardware module.
 *
 * Input Parameters:
 *   priv - A reference to the lower half PWM driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int pwm_shutdown(struct pwm_lowerhalf_s *dev)
{
  struct xmc4_pwm_s *priv = (struct xmc4_pwm_s *)dev;

  DEBUGASSERT(priv != NULL);

  /* Disable slice */

  pwm_stop(dev);

  /* Disable module if not used anymore */

  if (!pwm_is_module_used(priv))
    {
      pwm_disable_module(priv);
    }

  priv->f_tclk = 0;
  priv->prescaler = 0;

  return OK;
}

/*****************************************************************************
 * Name: pwm_ioctl
 *
 * Description:
 *   Lower-half logic may support platform-specific ioctl commands
 *
 *****************************************************************************/

static int pwm_ioctl(struct pwm_lowerhalf_s *dev, int cmd, unsigned long arg)
{
  struct xmc4_pwm_s *priv = (struct xmc4_pwm_s *)dev;

  DEBUGASSERT(dev);

  /* There are no platform-specific ioctl commands */

  UNUSED(priv);

  return -ENOTTY;
}

/*****************************************************************************
 * Public Functions
 *****************************************************************************/

/*****************************************************************************
 * Name: xmc4_pwminitialize
 *
 * Description:
 *   Initialize one timer for use with the upper_level PWM driver.
 *
 * Input Parameters:
 *   module - A number identifying the CCU4x use, in the range of {0,..,3}.
 *   slice - A number identifying the CC4y use, in the range of {0,..,3}.
 *
 * Returned Value:
 *   On success, a pointer to the XMC4 lower half PWM driver is returned.
 *   NULL is returned on any failure.
 *
 *****************************************************************************/

