apache/nuttx/arch/arm/src/xmc4/xmc4_pwm.c
struct pwm_lowerhalf_s *xmc4_pwminitialize(int module, int slice)
{
  struct xmc4_pwm_s *lower = NULL;

  pwminfo("CCU4%u,CC4%u\n", module, slice);

  switch (module)
  {
#ifdef CONFIG_XMC4_CCU40
  case 0:
  {
    switch (slice)
    {
#ifdef CONFIG_XMC4_CCU40_CC40
    case 0:
    {
      lower = &g_pwm00;
      break;
    }
#endif

#ifdef CONFIG_XMC4_CCU40_CC41
    case 1:
    {
      lower = &g_pwm01;
      break;
    }
#endif

#ifdef CONFIG_XMC4_CCU40_CC42
    case 2:
    {
      lower = &g_pwm02;
      break;
    }
#endif

#ifdef CONFIG_XMC4_CCU40_CC43
    case 3:
    {
      lower = &g_pwm03;
      break;
    }
#endif

    default:
    {
      pwmerr("ERROR: No such CCU4%d,CC4%d existing %d\n", module, slice);
      lower = NULL;
      goto errout;
    }
    }

    break;
  }
#endif /* CONFIG_XMC4_CCU40 */

#ifdef CONFIG_XMC4_CCU41
  case 1:
  {
    switch (slice)
    {
#ifdef CONFIG_XMC4_CCU41_CC40
    case 0:
    {
      lower = &g_pwm10;
      break;
    }
#endif

#ifdef CONFIG_XMC4_CCU41_CC41
    case 1:
    {
      lower = &g_pwm11;
      break;
    }
#endif

#ifdef CONFIG_XMC4_CCU41_CC42
    case 2:
    {
      lower = &g_pwm12;
      break;
    }
#endif

#ifdef CONFIG_XMC4_CCU41_CC43
    case 3:
    {
      lower = &g_pwm13;
      break;
    }
#endif

    default:
    {
      pwmerr("ERROR: No such CCU4%d,CC4%d existing %d\n", module, slice);
      lower = NULL;
      goto errout;
    }
    }

    break;
  }
#endif /* CONFIG_XMC4_CCU41 */

#ifdef CONFIG_XMC4_CCU42
  case 2:
  {
    switch (slice)
    {
#ifdef CONFIG_XMC4_CCU42_CC40
    case 0:
    {
      lower = &g_pwm20;
      break;
    }
#endif

#ifdef CONFIG_XMC4_CCU42_CC41
    case 1:
    {
      lower = &g_pwm21;
      break;
    }
#endif

#ifdef CONFIG_XMC4_CCU42_CC42
    case 2:
    {
      lower = &g_pwm22;
      break;
    }
#endif

#ifdef CONFIG_XMC4_CCU42_CC43
    case 3:
    {
      lower = &g_pwm23;
      break;
    }
#endif

    default:
    {
      pwmerr("ERROR: No such CCU4%d,CC4%d existing %d\n", module, slice);
      lower = NULL;
      goto errout;
    }
    }

    break;
  }
#endif /* CONFIG_XMC4_CCU42 */

#ifdef CONFIG_XMC4_CCU43
  case 3:
  {
    switch (slice)
    {
#ifdef CONFIG_XMC4_CCU43_CC40
    case 0:
    {
      lower = &g_pwm30;
      break;
    }
#endif

#ifdef CONFIG_XMC4_CCU43_CC41
    case 1:
    {
      lower = &g_pwm31;
      break;
    }
#endif

#ifdef CONFIG_XMC4_CCU43_CC42
    case 2:
    {
      lower = &g_pwm32;
      break;
    }
#endif

#ifdef CONFIG_XMC4_CCU43_CC43
    case 3:
    {
      lower = &g_pwm33;
      break;
    }
#endif

    default:
    {
      pwmerr("ERROR: No such CCU4%d,CC4%d existing %d\n", module, slice);
      lower = NULL;
      goto errout;
    }
    }

    break;
  }
#endif /* CONFIG_XMC4_CCU43 */

  default:
  {
    pwmerr("ERROR: No such CCU4%d,CC4%d existing %d\n", module, slice);
    lower = NULL;
    goto errout;
  }
  }

errout:
  return (struct pwm_lowerhalf_s *)lower;
}
